In [ ]:
Vlookup is essentially used for vertically arranged data. Vlookup is an operation used to merge 2 different data tables based on some condition where there must be at least 1 common attribute(column) between the two tables. After performing this operation we get a table consisting of all the data from both the tables for which the data is matched.

We can use merge() function to perform Vlookup in pandas. The merge function does the same job as the Join in SQL We can perform the merge operation with respect to table 1 or table 2.There can be different ways of merging the 2 tables.

In [12]:
import pandas as pd
import numpy as np

In [13]:
student = ({'Name':['Arjun', 'Karan', 'Harsh', 'Rakesh'],
     'Age':[19, 20, 20,21], 'Department':['CS', 'EC', 'CS', 'IT']})

In [14]:
df = pd.DataFrame(student)

In [15]:
df

     Name  Age Department
0   Arjun   19         CS
1   Karan   20         EC
2   Harsh   20         CS
3  Rakesh   21         IT

In [16]:
student_course_enroll = ({'Name':['Arjun', 'Harsh','Rakesh','Raman', 'Karan'],
                          'Courses':['Machine Learning', 'OOPS with java', 'web dev', 'OOPS with Java', 'Data Structures']}  )

In [17]:
df2 = pd.DataFrame(student_course_enroll)

In [19]:
df

     Name  Age Department
0   Arjun   19         CS
1   Karan   20         EC
2   Harsh   20         CS
3  Rakesh   21         IT

In [20]:
df2

     Name           Courses
0   Arjun  Machine Learning
1   Harsh    OOPS with java
2  Rakesh           web dev
3   Raman    OOPS with Java
4   Karan   Data Structures

In [21]:
combine_data = pd.merge(df,df2,
                     on = 'Name', 
                       how = 'inner')

In [22]:
combine_data

     Name  Age Department           Courses
0   Arjun   19         CS  Machine Learning
1   Karan   20         EC   Data Structures
2   Harsh   20         CS    OOPS with java
3  Rakesh   21         IT           web dev